'''
    1 이상 N 이하의 서로 다른 자연수 번호가 붙은 N개의 보석이 있다.
    각 보석의 색은 1 이상 K 이하의 정수로 나타낼 수 있으며, i번 보석의 색은 Ci이다. 
    또한 각 보석은 당연히 가치가 있으며, i번 보석의 가치는 Vi이다.

    소혜는 몇 개의 보석을 골라 전시하고자 하는데, 
    이때 선택한 보석의 집합은 아래 조건을 만족해야 한다.

    -  선택된 각 보석에 대해, 그 보석과 색이 같은 다른 보석이 1개 이상 선택되었다.
 
    1 이상 N 이하의 모든 정수 x에 대해, 정확히 x개의 보석을 골라 전시하는 것이 가능한지 판단하고,
    가능하다면 선택된 보석들의 가치 합 최댓값이 얼마인지 구하는 프로그램을 작성하라.

[입력]
 
    첫 번째 줄에 테스트 케이스의 수 T가 주어진다.

    각 테스트 케이스의 첫 번째 줄에는 N(1 ≤ N ≤ 200,000)과 K(1 ≤ K ≤ ⌊N/2⌋)가 주어진다.
    다음 N개의 줄에는 두 개의 정수 Ci와 Vi (1 ≤ Ci ≤ K, 1 ≤ Vi ≤ 109)가 한 줄에 하나씩 주어진다.
    모든 색에 대해, 그 색을 띤 보석이 2개 이상 존재함이 보장된다.

[출력]
 
    각 테스트 케이스마다 ‘#x’(x는 테스트케이스 번호를 의미하며 1부터 시작한다)를 출력하고,

    한 줄에 N개의 정수를 공백 하나를 사이로 두고 출력한다.
    이중 x번째 정수는 정확히 x개의 보석을 골라 전시하는 것이 불가능하다면 ‘-1’이고, 
    가능하다면 선택된 보석들의 가치 합 최댓값이어야 한다.
'''

class bosuk :
    color = 0
    value = 0
    
bosuk1 = bosuk()
bosuk1.color = 2
print(bosuk1.color, bosuk1.value)

