/*
    지민이는 자신의 저택에서 MN개의 단위 정사각형으로 나누어져 있는 M*N 크기의 보드를 찾았다.
    어떤 정사각형은 검은색으로 칠해져 있고, 나머지는 흰색으로 칠해져있다. 지민이는 이 보드를
    잘라서 8*8 크기의 체스판으로 만들려고 한다.

    체스판은 검은색과 흰색이 번갈아서 칠해져 있어야 한다. 구체적으로, 각 칸이 검은색과 흰색으로
    색칠돼잇고, 변을 공유하는 두 개의 사각형은 다른 색으로 칠해져 있어야한다. 따라서 이 정의를
    따르면 체스판을 색칠하는 경우는 두 가지뿐이다. 하나는 맨 위쪽 위 칸이 흰색인 경우,
    하나는 검은색인 경우이다.
*
    보드가 체스판처럼 칠해져 있다는 보장이 없어서, 지민이는 8*8 크기의 체스판으로 잘라낸 후에
    몇 개의 정사각형을 다시 칠해야겠다고 생각했다. 당연히 8*8 크기는 아무데서나 골라도 된다.
    지민이가 다시 칠해야하는 정사각형의 최소 개수를 구하는 프로그램을 작성하시오.

    input : 첫째 줄에 N, M이 주어진다. (8<=N,M<=50)
            둘째 줄부터 N개의 줄에는 보드의 각 행의 상태가 주어진다.
            B는 검은색, W는 하얀색이다.
    output: 첫째 줄에 지민이가 다시 칠해야 하는 정사각형 개수의 최솟값을 출력한다.
*/

#include <iostream>

#define WHITE 1
#define BLACK 0
#define MAX_SIZE 50
using namespace std;

int main() {
    int N, M;

    //체스판은 M*N이다. (가로 길이 M, 세로 길이 N)
    cin >> N >> M;
    

}
