/* 사탕가게에 설탕을 정확하게 N키롤그램을 배달해야함. 설탕공장에서 만드는 설탕은 3, 5kg 봉지가 있다.						*/
/* 상근이는 귀찮기 때문에, 최대한 적은 봉지를 가져가려함. 예를 들어 18kg을 배달하려면 5kg 3개, 3kg 1개를 들고가면 된다.		*/

/* 입력 : 첫 째줄에 N이 주어짐 ( 3 <= N <= 5,000 )																	*/
/* 출력 : 상근이가 배달하는 봉지의 최고 개수를 출력, 만약 정확하게 N kg을 배달할 수 없다면 -1 출력							*/

// a : 3kg 봉지의 갯수, b : 5kg 봉지의 갯수라고 할 때,
// 3a + 5b = N 을 만족시키는 a+b의 최소값을 구하는 문제이다.
// 위 식을 b에 대하여 정리하면 b = (1/5)(-3a + N) 이고 a+b 에 대입하면
// a+b = (1/5)(2a + N) 라 할 때, a+b는 자연수 이므로 2a + N 이 가장 작은 5의 배수가 되는 a를 구하여 
// 위 식에 대입하면 된다. 

// N >= 3 에 대하여 a 는 1 3 0 2 4 패턴을 유지하며 가장 작은 5의 배수를 만든다. 또한 3a + 5b = N 이므로
// 2a + N = (5의 배수) 를 만족하는 a 대하여 3a <= N 을 만족해야하는데, (b=(-3a + N)/5 이기 때문이다)
// 규칙중 가장 큰 a의 경우가 4 이므로
// N >= 12 에 대하여 a, b가 자연수임을 만족시키는 N이 항상 존재하므로 N <= 12 인 범위에서는 항상 배달이 가능하지만
// N = 4, 7 의 경우 배달할 수 없으므로 예외처리를 해주어야 한다. 

#include<stdio.h>

int main() {
	int n, a;
	int pattern[5] = {1, 3, 0, 2, 4};

	scanf("%d", &n);
	if(n == 4 || n == 7)	printf("-1\n");
	else {
		a = pattern[(n-3)%5];
		printf("%d\n", (2*a + n)/5);
	}

	return 0;
}